app/controllers/minions_controller.rb

    def index
        @minions = Minion.order(nome: :asc)
        @minion_com_desconto = Minion.order(:preco).limit 2
---
SELECT "minions".* FROM "minions" ORDER BY "minions"."nome" ASC
SELECT  "minions".* FROM "minions" ORDER BY "minions"."preco" ASC LIMIT $1  [["LIMIT", 1]]

    def update
        if @minion.update minion_params
---
UPDATE "minions" SET "descricao" = $1, "preco" = $2, "quantidade" = $3, "updated_at" = $4 WHERE "minions"."id" = $5  [["descricao", "tete 123"], ["preco", "59.99"], ["quantidade", 20], ["updated_at", "2019-02-13 18:34:57.062115"], ["id", 14]]

    def create
        @minion = Minion.new minion_params
        if @minion.save
---
INSERT INTO "minions" ("nome", "descricao", "preco", "quantidade", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nome", "teste789456"], ["descricao", "testeste"], ["preco", "0.2"], ["quantidade", 2], ["created_at", "2019-02-13 18:35:25.332638"], ["updated_at", "2019-02-13 18:35:25.332638"]]

    def destroy
        @minion.destroy
---
DELETE FROM "minions" WHERE "minions"."id" = $1  [["id", 11]]

    def busca
        @nome = params[:nome]
        @minions = Minion.where("lower(nome) like ?", "%#{@nome.downcase}%")
---
SELECT "minions".* FROM "minions" WHERE (lower(nome), upper(nome) like '%dave%')

    def set_minion
        @minion = Minion.find(params[:id])
---
SELECT  "minions".* FROM "minions" WHERE "minions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]